In [1]:
import pandas as pd
import numpy as np
from pandas import *

In [11]:
dados_pessoais = {'Nome':['Pedro Roberto','Jonathan Igor','Gomes Costa','Manoel Maya'],
                 'Idade':[24,28,32,35],
                  'Cor':['Branco','Negro','Pardo','Branco'],
                  'Estado Civil':['Solteiro','Casado','Viúvo','Solteiro']}

produtos = {'Café':['Pão','Leite','Café','Margarina','Mortadela'],
           'Limpeza':['Desinfetante','Candida','Sabão','Alvejante'],
            'Higiene':['Papel Higiênico','Pasta de dente','sabonete','Shampo']}


eletronicos = {'Computadores':['Placa Mãe','Memória Ram','Placa de vídeo','HD'],
              'Quantidade':[40,100,50,80],
              'Preço Unidade':[245.40,120.40,210.10,90.40]}

investimentos = {'CDBs':['Pós fixado','Pré fixado','IPCA','Dólar'],
                'Tesouro Direto':['Pós fixaxo','Pré fixado','IPCA','Dólar']}

In [3]:
frame = pd.DataFrame(dados_pessoais)

In [4]:
frame

            Nome  Idade     Cor Estado Civil
0  Pedro Roberto     24  Branco     Solteiro
1  Jonathan Igor     28   Negro       Casado
2    Gomes Costa     32   Pardo        Viúvo
3    Manoel Maya     35  Branco     Solteiro

In [5]:
# Mude as informações dos índices.
frame = pd.DataFrame(dados_pessoais, index=['Zero','Um','Dois','Três'])

In [6]:
frame

               Nome  Idade     Cor Estado Civil
Zero  Pedro Roberto     24  Branco     Solteiro
Um    Jonathan Igor     28   Negro       Casado
Dois    Gomes Costa     32   Pardo        Viúvo
Três    Manoel Maya     35  Branco     Solteiro

In [7]:
frame= pd.DataFrame(dados_pessoais, index=['a','b','c','d'])

In [8]:
frame

            Nome  Idade     Cor Estado Civil
a  Pedro Roberto     24  Branco     Solteiro
b  Jonathan Igor     28   Negro       Casado
c    Gomes Costa     32   Pardo        Viúvo
d    Manoel Maya     35  Branco     Solteiro

In [21]:
frame = pd.DataFrame(dados_pessoais, index=[0,1,2,3])

In [22]:
frame

            Nome  Idade     Cor Estado Civil
0  Pedro Roberto     24  Branco     Solteiro
1  Jonathan Igor     28   Negro       Casado
2    Gomes Costa     32   Pardo        Viúvo
3    Manoel Maya     35  Branco     Solteiro

In [12]:
frame.columns

Index(['Nome', 'Idade', 'Cor', 'Estado Civil'], dtype='object')

In [13]:
frame.values

array([['Pedro Roberto', 24, 'Branco', 'Solteiro'],
       ['Jonathan Igor', 28, 'Negro', 'Casado'],
       ['Gomes Costa', 32, 'Pardo', 'Viúvo'],
       ['Manoel Maya', 35, 'Branco', 'Solteiro']], dtype=object)

In [14]:
frame['Idade']

Azul        24
Amarelo     28
Verde       32
Vermelho    35
Name: Idade, dtype: int64

In [15]:
frame['Nome']

Azul        Pedro Roberto
Amarelo     Jonathan Igor
Verde         Gomes Costa
Vermelho      Manoel Maya
Name: Nome, dtype: object

In [17]:
frame.loc['Azul']

Nome            Pedro Roberto
Idade                      24
Cor                    Branco
Estado Civil         Solteiro
Name: Azul, dtype: object

In [18]:
frame.loc['Vermelho']

Nome            Manoel Maya
Idade                    35
Cor                  Branco
Estado Civil       Solteiro
Name: Vermelho, dtype: object

In [20]:
frame.loc[['Azul','Verde']]

                Nome  Idade     Cor Estado Civil
Azul   Pedro Roberto     24  Branco     Solteiro
Verde    Gomes Costa     32   Pardo        Viúvo

In [23]:
frame['Estado Civil'][2]

'Viúvo'

In [24]:
frame['Idade'][1]

28

In [25]:
frame.columns.name = 'Id'

In [26]:
frame

Id           Nome  Idade     Cor Estado Civil
0   Pedro Roberto     24  Branco     Solteiro
1   Jonathan Igor     28   Negro       Casado
2     Gomes Costa     32   Pardo        Viúvo
3     Manoel Maya     35  Branco     Solteiro

In [27]:
frame['Cidade']=['São Pualo','Fortaleza','Rio de Janeiro','Belo Horizonte']

In [28]:
frame

Id           Nome  Idade     Cor Estado Civil          Cidade
0   Pedro Roberto     24  Branco     Solteiro       São Pualo
1   Jonathan Igor     28   Negro       Casado       Fortaleza
2     Gomes Costa     32   Pardo        Viúvo  Rio de Janeiro
3     Manoel Maya     35  Branco     Solteiro  Belo Horizonte